package com.android.tomflying.bean;

/**
 * 作者：tom_flying
 * 邮箱：tom_flying@163.com
 * 博客: www.tianfeifei.com
 * 创建日期: 2018/7/12
 * 描述：
 */
public class MeiwenBean {

    /**
     * data : {"date":{"curr":"20180712","prev":"20180711","next":"20180713"},"author":"卢梭","title":"生活在大自然的怀抱里","digest":"为了到花园里看日出，我比太阳起得更早；如果这是一个晴天，我最殷切的期望是不要有信件或来访扰乱这一天的清宁。我用上午的时间做各种杂事。每件事都","content":"<p>为了到花园里看日出，我比太阳起得更早；如果这是一个晴天，我最殷切的期望是不要有信件或来访扰乱这一天的清宁。我用上午的时间做各种杂事。每件事都是我乐意完成的，因为这都不是非立即处理不可的急事，然后我匆忙用膳，为的是躲避那些不受欢迎的来访者，并且使自己有一个充裕的下午。即使最炎热的日子，在中午一时前我就顶着烈日带着芳夏特〔芳夏特〕卢梭养的一条狗的名字出发了。由于担心不速之客会使我不能脱身，我加紧了步伐。可是，一旦绕过一个拐角，我觉得自己得救了，就激动而愉快地松了口气，自言自语说：\u201c今天下午我是自己的主宰了！\u201d从此，我迈着平静的步伐，到树林中去寻觅一个荒野的角落，一个人迹不至因而没有任何奴役和统治印记的荒野的角落，一个我相信在我之前从未有人到过的幽静的角落，那儿不会有令人厌恶的第三者跑来横隔在大自然和我之间。那儿，大自然在我眼前展开一幅永远清新的华丽的图景。金色的燃料木、紫红的欧石南非常繁茂，给我深刻的印象，使我欣悦；我头上树木的宏伟、我四周灌木的纤丽、我脚下花草的惊人的纷繁使我目不暇接，不知道应该观赏还是赞叹；这么多美好的东西争相吸引我的注意力，使我眼花缭乱，使我在每件东西面前留连，从而助长我懒惰和爱空想的习气，使我常常想：\u201c不，全身辉煌的所罗门也无法同它们当中任何一个相比。\u201d<\/p><p>我的想像不会让如此美好的土地长久渺无人烟。我按自己的意愿在那儿立即安排了居民，我把舆论、偏见和所有虚假的感情远远驱走，使那些配享受如此佳境的人迁进这大自然的乐园。我将把他们组成一个亲切的社会，而我相信自己并非其中不相称的成员。我按照自己的喜好建造一个黄金的世纪，并用那些我经历过的给我留下甜美记忆的情景和我的心灵还在憧憬的情境充实这美好的生活，我多么神往人类真正的快乐，如此甜美、如此纯洁，但如今已经远离人类的快乐。甚至每当念及此，我的眼泪就夺眶而出！啊！这个时刻，如果有关巴黎、我的世纪、我这个作家的卑微的虚荣心的念头来扰乱我的遐想，我就怀着无比的轻蔑立即将它们赶走，使我能够专心陶醉于这些充溢我心灵的美妙的感情！然而，在遐想中，我承认，我幻想的虚无有时会突然使我的心灵感到痛苦。甚至即使我所有的梦想变成现实，我也不会感到满足：我还会有新的梦想、新的期望、新的憧憬。我觉得我身上有一种没有什么东西能够填满的无法解释的空虚，有一种虽然我无法阐明、但我感到需要的对某种其他快乐的向往。然而，先生，甚至这种向往也是一种快乐，因为我从而充满一种强烈的感情和一种迷人的感伤──而这都是我不愿意舍弃的东西。<\/p><p>    <\/p><p>立即将我的思想从低处升高，转向自然界所有的生命，转向事物普遍的体系，转向主宰一切的不可思议的上帝。此刻我的心灵迷失在大千世界里，我停止思维，我停止冥想，我停止哲学的推理；我怀着快感，感到肩负着宇宙的重压，我陶醉于这些伟大观念的混杂，我喜欢任由我的想像在空间驰骋；我禁锢在生命的疆界内的心灵感到这儿过分狭窄，我在天地间感到窒息，我希望投身到一个无限的世界中去。我相信，如果我能够洞悉大自然所有的奥秘，我也许不会体会这种令人惊异的心醉神迷，而处在一种没有那么甜美的状态里；我的心灵所沉湎的这种出神入化的佳境使我在亢奋激动中有时高声呼唤：\u201c啊，伟大的上帝呀！啊，伟大的上帝呀！\u201d但除此之外，我不能讲出也不能思考任何别的东西。<\/p>","wc":1356}
     */

    private Data data;

    public Data getData() {
        return data;
    }

    public void setData(Data data) {
        this.data = data;
    }

    public static class Data {
        /**
         * date : {"curr":"20180712","prev":"20180711","next":"20180713"}
         * author : 卢梭
         * title : 生活在大自然的怀抱里
         * digest : 为了到花园里看日出，我比太阳起得更早；如果这是一个晴天，我最殷切的期望是不要有信件或来访扰乱这一天的清宁。我用上午的时间做各种杂事。每件事都
         * content : <p>为了到花园里看日出，我比太阳起得更早；如果这是一个晴天，我最殷切的期望是不要有信件或来访扰乱这一天的清宁。我用上午的时间做各种杂事。每件事都是我乐意完成的，因为这都不是非立即处理不可的急事，然后我匆忙用膳，为的是躲避那些不受欢迎的来访者，并且使自己有一个充裕的下午。即使最炎热的日子，在中午一时前我就顶着烈日带着芳夏特〔芳夏特〕卢梭养的一条狗的名字出发了。由于担心不速之客会使我不能脱身，我加紧了步伐。可是，一旦绕过一个拐角，我觉得自己得救了，就激动而愉快地松了口气，自言自语说：“今天下午我是自己的主宰了！”从此，我迈着平静的步伐，到树林中去寻觅一个荒野的角落，一个人迹不至因而没有任何奴役和统治印记的荒野的角落，一个我相信在我之前从未有人到过的幽静的角落，那儿不会有令人厌恶的第三者跑来横隔在大自然和我之间。那儿，大自然在我眼前展开一幅永远清新的华丽的图景。金色的燃料木、紫红的欧石南非常繁茂，给我深刻的印象，使我欣悦；我头上树木的宏伟、我四周灌木的纤丽、我脚下花草的惊人的纷繁使我目不暇接，不知道应该观赏还是赞叹；这么多美好的东西争相吸引我的注意力，使我眼花缭乱，使我在每件东西面前留连，从而助长我懒惰和爱空想的习气，使我常常想：“不，全身辉煌的所罗门也无法同它们当中任何一个相比。”</p><p>我的想像不会让如此美好的土地长久渺无人烟。我按自己的意愿在那儿立即安排了居民，我把舆论、偏见和所有虚假的感情远远驱走，使那些配享受如此佳境的人迁进这大自然的乐园。我将把他们组成一个亲切的社会，而我相信自己并非其中不相称的成员。我按照自己的喜好建造一个黄金的世纪，并用那些我经历过的给我留下甜美记忆的情景和我的心灵还在憧憬的情境充实这美好的生活，我多么神往人类真正的快乐，如此甜美、如此纯洁，但如今已经远离人类的快乐。甚至每当念及此，我的眼泪就夺眶而出！啊！这个时刻，如果有关巴黎、我的世纪、我这个作家的卑微的虚荣心的念头来扰乱我的遐想，我就怀着无比的轻蔑立即将它们赶走，使我能够专心陶醉于这些充溢我心灵的美妙的感情！然而，在遐想中，我承认，我幻想的虚无有时会突然使我的心灵感到痛苦。甚至即使我所有的梦想变成现实，我也不会感到满足：我还会有新的梦想、新的期望、新的憧憬。我觉得我身上有一种没有什么东西能够填满的无法解释的空虚，有一种虽然我无法阐明、但我感到需要的对某种其他快乐的向往。然而，先生，甚至这种向往也是一种快乐，因为我从而充满一种强烈的感情和一种迷人的感伤──而这都是我不愿意舍弃的东西。</p><p>    </p><p>立即将我的思想从低处升高，转向自然界所有的生命，转向事物普遍的体系，转向主宰一切的不可思议的上帝。此刻我的心灵迷失在大千世界里，我停止思维，我停止冥想，我停止哲学的推理；我怀着快感，感到肩负着宇宙的重压，我陶醉于这些伟大观念的混杂，我喜欢任由我的想像在空间驰骋；我禁锢在生命的疆界内的心灵感到这儿过分狭窄，我在天地间感到窒息，我希望投身到一个无限的世界中去。我相信，如果我能够洞悉大自然所有的奥秘，我也许不会体会这种令人惊异的心醉神迷，而处在一种没有那么甜美的状态里；我的心灵所沉湎的这种出神入化的佳境使我在亢奋激动中有时高声呼唤：“啊，伟大的上帝呀！啊，伟大的上帝呀！”但除此之外，我不能讲出也不能思考任何别的东西。</p>
         * wc : 1356
         */

        private Date date;
        private String author;
        private String title;
        private String digest;
        private String content;
        private int wc;

        public Date getDate() {
            return date;
        }

        public void setDate(Date date) {
            this.date = date;
        }

        public String getAuthor() {
            return author;
        }

        public void setAuthor(String author) {
            this.author = author;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getDigest() {
            return digest;
        }

        public void setDigest(String digest) {
            this.digest = digest;
        }

        public String getContent() {
            return content;
        }

        public void setContent(String content) {
            this.content = content;
        }

        public int getWc() {
            return wc;
        }

        public void setWc(int wc) {
            this.wc = wc;
        }

        public static class Date {
            /**
             * curr : 20180712
             * prev : 20180711
             * next : 20180713
             */

            private String curr;
            private String prev;
            private String next;

            public String getCurr() {
                return curr;
            }

            public void setCurr(String curr) {
                this.curr = curr;
            }

            public String getPrev() {
                return prev;
            }

            public void setPrev(String prev) {
                this.prev = prev;
            }

            public String getNext() {
                return next;
            }

            public void setNext(String next) {
                this.next = next;
            }
        }
    }
}
